Обработки/Reports/_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Сведения об оценке в соответствии с информационным письмом ЦБ РФ",
		"1.09",
		"",
		Истина);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// Начало сессии статистики
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыВыполнения	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Сессия	 			= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	
	// Формирование
	
	Отказ = Ложь;
	
	ПараметрыШапки	= РаботаСОтчетами.ПолучитьПараметрыШапки(ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	ДанныеОтчета	= Новый Структура;
	ДанныеОтчета.Вставить("НаименованиеОрганизации", ПараметрыШапки.ДоверительныйУправляющий);
	ДанныеОтчета.Вставить("РазницаСтоимости", "Нет");
	ДанныеОтчета.Вставить("ФинансовыеИнструменты", "-");
	ДанныеОтчета.Вставить("ДокументОснование", "-");
	ДанныеОтчета.Вставить("ДанныеРасчета", );
	
	ДанныеОтчета.Вставить("АктуальностьСтолбец2", "нет");
	ДанныеОтчета.Вставить("СрокиСтолбец2", "Решение  об отказе от послаблений  будет принято не позднее 30.12.2022г в зависимости от ситуации на финансовом рынке");
	ДанныеОтчета.Вставить("ИспользованиеСтолбец7", "да, не размещается на официальном сайте УК информация, предусмотренная подпунктом ""а"" пункта 14 и пунктом 15 " 
		+ "Стандарта раскрытия информации об инвестировании средств пенсионных накоплений, утвержденного приказом Минфина России от 01 декабря 2020 н. № 293н " 
		+ """Об утверждении Стандарта раскрытия информации об инвестировании средств пенсионных накоплений"" (далее-Стандарт), а также ограничен доступ неограниченному " 
		+ "кругу лиц к ознакомлению с ранее размещенной информацией, предусмотренной подпунктом ""а"" пункта 14 и пунктом 15 Стандарта");
	ДанныеОтчета.Вставить("ИспользованиеСтолбец8", "-");
	ДанныеОтчета.Вставить("АктуальностьСтолбец8", "-");
	ДанныеОтчета.Вставить("СрокиСтолбец8", "-");
	
	Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		ДанныеОтчета.Вставить("ДокументОснование", "Приказ № ЭМ/2022/03/21-2 от 21.03.2022г");
	ИначеЕсли ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		ДанныеОтчета.Вставить("ДокументОснование", "Приказ № РТ/2022/03/21-2 от 21.03.2022г");
	КонецЕсли; 
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
	
	Если НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда
		
		ДанныеОтчета.РазницаСтоимости = "Да";	
		
		#Область Получение_текущей_СЧА
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
			|	И НАЧАЛОПЕРИОДА(ФинансовыеПоказатели.Период, ДЕНЬ) = &Период");
		
		Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Период",							ЭтотОбъект.Период);
		
		ВыборкаСЧА = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаСЧА.Следующий() Тогда
			ТекущаяСЧА = ВыборкаСЧА.Значение;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На выбранную дату СЧА не зарегистрирована!", ЭтотОбъект, "Период", , Отказ);
		КонецЕсли;
		
		#КонецОбласти
			
		Если Не Отказ Тогда
		
			СЧАБезРасчетаПоПисьму = ПолучитьРегистрациюСтоимостиАктивовБезРасчетаПоПисьму(Отказ).СЧАРынок;
			
			Если Не Отказ Тогда
			
				ДанныеОтчета.РазницаСтоимости = ДанныеОтчета.РазницаСтоимости + ", " + Формат(СЧАБезРасчетаПоПисьму - ТекущаяСЧА, "ЧДЦ=3; ЧС=3; ЧН=; ЧФ='Ч тыс. руб.'");
				ДанныеОтчета.ДанныеРасчета	  = Новый Структура("СЧАБезРасчетаПоПисьму, ТекущаяСЧА", СЧАБезРасчетаПоПисьму, ТекущаяСЧА);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеОтчета.ФинансовыеИнструменты = "Весь портфель";
			
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	Макет.Параметры.Заполнить(ДанныеОтчета); 
	
	ДокументРезультат.Вывести(Макет);
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, Механизм, Истина, ОриентацияСтраницы.Портрет);
	
	// Фиксация сессии статистики
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия); 
	
КонецПроцедуры

Функция ПолучитьРегистрациюСтоимостиАктивовБезРасчетаПоПисьму(Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
	
		// Отменяем расчет по письму
		
		ОтменаРасчетаПоПисьмуЦБ = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
		ОтменаРасчетаПоПисьмуЦБ.Объект		= ЭтотОбъект.СчетДоверительногоУправления;
		ОтменаРасчетаПоПисьмуЦБ.Свойство	= ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "ДатаНачалаРасчетаПоПисьмуЦБ0185316");
		ОтменаРасчетаПоПисьмуЦБ.Удалить();
		
		// Отменяем фиксацию курса валюты
		
		ДанныеОтменыКурса = Новый Соответствие;
		
		ОтменаКурсаВалютыПоПисьму = Документы.КорректировкаРегистров.СоздатьДокумент();
		ОтменаКурсаВалютыПоПисьму.Дата							= ЭтотОбъект.Период;
		ОтменаКурсаВалютыПоПисьму.Организация					= ЭтотОбъект.Организация;
		ОтменаКурсаВалютыПоПисьму.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
		ОтменаКурсаВалютыПоПисьму.Ответственный					= РаботаСПользователями.ТекущийПользователь();
		ОтменаКурсаВалютыПоПисьму.ТаблицаРегистров.Добавить().Имя = Метаданные.РегистрыСведений.ОценкиСтоимостиЦенныхБумаг.Имя;
		
		ОценкиКурсаВалюты = ПолучитьОценкиКурсаВалюты(ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
			
		Для Каждого ОценкаКурса Из ОценкиКурсаВалюты Цикл
			
			Если ОценкаКурса.Период = ЭтотОбъект.Период Тогда
				
				// Правим движения документа, заведенного в день оценки
				
				НаборДокумента = ДанныеОтменыКурса.Получить(ОценкаКурса.Регистратор);
				Если НаборДокумента = Неопределено Тогда
					НаборДокумента = РегистрыСведений.ОценкиСтоимостиЦенныхБумаг.СоздатьНаборЗаписей();
					НаборДокумента.Отбор.Регистратор.Установить(ОценкаКурса.Регистратор);
					НаборДокумента.Прочитать();
				КонецЕсли;
				
				Для Каждого СтрокаНабора Из НаборДокумента Цикл
					Если СтрокаНабора.ЦеннаяБумага = ОценкаКурса.ЦеннаяБумага
						И СтрокаНабора.ПовышенныйПриоритет = ОценкаКурса.ПовышенныйПриоритет
					Тогда
						СтрокаНабора.КурсВалютыНоминала = Неопределено;		
					КонецЕсли;
				КонецЦикла;
				
				ДанныеОтменыКурса.Вставить(ОценкаКурса.Регистратор, НаборДокумента);
				
			Иначе
			
				// Добавляем отменяющие записи
				
				ОтменяющаяЗапись = ОтменаКурсаВалютыПоПисьму.Движения.ОценкиСтоимостиЦенныхБумаг.Добавить();  		
				
				ЗаполнитьЗначенияСвойств(ОтменяющаяЗапись, ОтменаКурсаВалютыПоПисьму); 
				ЗаполнитьЗначенияСвойств(ОтменяющаяЗапись, ОценкаКурса); 
				
				ОтменяющаяЗапись.Рынок				= РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ОценкаКурса.ЦеннаяБумага);
				ОтменяющаяЗапись.Период				= ОтменаКурсаВалютыПоПисьму.Дата;
				ОтменяющаяЗапись.КурсВалютыНоминала	= 0;
				
				ДанныеОтменыКурса.Вставить(ОтменаКурсаВалютыПоПисьму, ОтменаКурсаВалютыПоПисьму);
				
			КонецЕсли;
				
		КонецЦикла;
		
		Если ДанныеОтменыКурса.Количество() > 0 Тогда
			
			// Чтобы записать оценку курса, нужно снять даты запрета,
			// но чтобы партии потом брались из регистра, следует их вернуть обратно
			
			ОтборДатЗапретаРедактирования = РегистрыСведений.ДатыЗапретаРедактирования.СформироватьСтруктуруОтбораДатЗапрета(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
			ДатыЗапретаРедактирования	  = РегистрыСведений.ДатыЗапретаРедактирования.ПолучитьДатыЗапретаРедактирования(ОтборДатЗапретаРедактирования, Истина);
			
			Для каждого ОтменаКурса Из ДанныеОтменыКурса Цикл
				ОтменаКурса.Значение.Записать();	
			КонецЦикла; 
			
			РегистрыСведений.ДатыЗапретаРедактирования.УстановитьДатыЗапретаРедактирования(ДатыЗапретаРедактирования, ОтборДатЗапретаРедактирования);
			
		КонецЕсли;
			
		// Выполняем расчет СЧА
		
		ПутьКФайлу			   = РаботаСПереоценкой.ПолучитьПутьКФайлуОценочнойСтоимостиПредоставленнойКлиентом(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период);
		АдресТаблицыСтоимостей = Неопределено;
		
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
			СвойстваФайла = Новый Файл(ПутьКФайлу);
			Если СвойстваФайла.Существует() И СвойстваФайла.ЭтоФайл() Тогда
				АдресТаблицыСтоимостей = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), Новый УникальныйИдентификатор);		       
			КонецЕсли;			
		КонецЕсли;			
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ПутьКФайлу",				ПутьКФайлу);
		ПараметрыЗаполнения.Вставить("АдресТаблицыСтоимостей",	АдресТаблицыСтоимостей);
		ПараметрыЗаполнения.Вставить("КонтрольСЧА",				Истина);

		РегистрацияСтоимостиАктивов = Документы.РегистрацияСтоимостиАктивов.СоздатьДокумент();
		
		РегистрацияСтоимостиАктивов.Организация						= ЭтотОбъект.Организация;
		РегистрацияСтоимостиАктивов.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;
		РегистрацияСтоимостиАктивов.Дата							= ЭтотОбъект.Период;
		РегистрацияСтоимостиАктивов.ЦельРасчетаСтоимостиОценки		= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
		
		РегистрацияСтоимостиАктивов.ЗаполнитьДокументыРегистрацииСтоимости(ПараметрыЗаполнения, Ложь, Отказ);

	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;	
		
	КонецПопытки;
		
	ОтменитьТранзакцию();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РегистрацияСтоимостиАктивов;
	
КонецФункции

Функция ПолучитьОценкиКурсаВалюты(ДатаПереоценки, Организация, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	
	// Определим курсы валют на 18.02.2022
	
	КурсыВалютПоПисьму = Новый ТаблицаЗначений;
	КурсыВалютПоПисьму.Колонки.Добавить("Валюта",	Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	КурсыВалютПоПисьму.Колонки.Добавить("Курс",		Новый ОписаниеТипов("Число"));
	
	ЗаполнитьЗначенияСвойств(КурсыВалютПоПисьму.Добавить(), Новый Структура("Валюта, Курс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Доллар_США"), 75.7527));
	ЗаполнитьЗначенияСвойств(КурсыВалютПоПисьму.Добавить(), Новый Структура("Валюта, Курс", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_ЕВРО"),		 86.1308));

	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(КурсыВалютПоПисьму, "_КурсыВалютПоПисьму", Запрос);	
	
	// Найдем такие в оценках
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.*
		|ИЗ
		|	РегистрСведений.ОценкиСтоимостиЦенныхБумаг.СрезПоследних(
		|			&ДатаПереоценки,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НАЧАЛОПЕРИОДА(ДатаОкончанияДействия, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаПереоценки, ДЕНЬ)) КАК ОценкиСтоимостиЦенныхБумагСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КурсыВалютПоПисьму КАК _КурсыВалютПоПисьму
		|		ПО (_КурсыВалютПоПисьму.Валюта = ОценкиСтоимостиЦенныхБумагСрезПоследних.ЦеннаяБумага.ВалютаНоминала)
		|			И (_КурсыВалютПоПисьму.Курс = ОценкиСтоимостиЦенныхБумагСрезПоследних.КурсВалютыНоминала)
		|ГДЕ
		|	ОценкиСтоимостиЦенныхБумагСрезПоследних.ПовышенныйПриоритет = ИСТИНА";
	
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаПереоценки",					ДатаПереоценки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
